БухЭксп/InformationRegisters/CW_УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПрисвоенияНомеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокПрисвоенияИсходящихНомеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Поставщики_Рубли</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Поставщики_Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Поставщики_УЕ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Клиенты_Рубли</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Клиенты_Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Клиенты_УЕ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетаФактурыПоПостановлению1137</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребованияПостановления735</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат</Name>
					<Comment>если флажок снят, то представление наследуется в точности, если установлен, то создаётся по обычному шаблону</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеОрганизацииАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьРуководителяОрганизацииАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОрганизацииАнгл</Name>
					<Comment>Адрес нашей организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфоДляПечатиСчетовПодвалРус</Name>
					<Comment>Дополнительная информация для печати счетов в валюте (рус.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфоДляПечатиСчетовПодвалАнгл</Name>
					<Comment>Дополнительная информация для печати счетов в валюте (англ.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОтраженияАвансовПоВозмещаемымДляУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияАвансовПоВозмещаемымДляУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьСтрокуКомиссионераВСчетахФактурах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнийНумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьСчетаФактурыНаПеревыставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаОперацииДляВходящихСчетовФактур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаОперацииДляИсходящихСчетовФактур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализироватьЗаписиКУДиР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяСтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойСпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьСчетаПокупателюНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьСчетаПоставщикаНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппировкаЗатратПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокЗаполненияЖурналаСчетовФактурПоПостановлению735</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСуммаСчетФактурыВСтрокахСводных</Name>
					<Comment>Применять рекомендации по письму № ЕД-4-15/21535@ от 08.12.2015</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяПрочихДоходовИРасходовДляКорректировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаКорректировкиОперативнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодставлятьПлатежныеДокументыПоРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьНаПечатьПолныйНомерДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьКурсыВалютАвансовДляБазыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОтраженияАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияАвансов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьТекущуюДатуИсходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНумерацииПутевыхЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнийНумераторПутевыхЛистов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаНЗП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантУчетаНЗП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедетсяУчетНЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлатежныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьЛоготипВПечатнуюФормуСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НЗППараметрНеВключать</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НЗППараметрДатаРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НЗПОтражатьВНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедетсяУчетНЗПДирективно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>включать НДС в себестоимость входящих услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвояОрганизацияВКачествеПокупателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвояОрганизацияКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвояОрганизацияДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_УчетнаяПолитика/Ext/ManagerModule.bsl
Функция ПолучитьСчетаУчетаРасчетов(Знач Организация, Знач Валюта, Знач ВУсловныхЕдиницах = Ложь, Знач Период=Неопределено, Знач ПоставщикПокупатель = Ложь) Экспорт
	
	СчетУчета = Неопределено;
	
	ПрефиксПоля = ?(ПоставщикПокупатель, "Поставщики_", "Клиенты_");
	Датасреза 	= ?(Период = Неопределено, ТекущаяДата(), Период);
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.Организация КАК Организация,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Поставщики_Рубли КАК Поставщики_Рубли,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Поставщики_Валюта КАК Поставщики_Валюта,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Поставщики_УЕ КАК Поставщики_УЕ,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Клиенты_Рубли КАК Клиенты_Рубли,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Клиенты_Валюта КАК Клиенты_Валюта,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Клиенты_УЕ КАК Клиенты_УЕ
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		
		Если ВУсловныхЕдиницах Тогда
			СчетУчета = Выборка[ПрефиксПоля+"УЕ"];
		Иначе
			
			Если Валюта = ВалютаРегламентированногоУчета Тогда
				СчетУчета = Выборка[ПрефиксПоля+"Рубли"];
			Иначе
				СчетУчета = Выборка[ПрефиксПоля+"Валюта"];
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СчетУчета; 
	
КонецФункции

Функция ПолучитьСведенияОбОрганизацииНаАнглийскомЯзыке(Организация, ДатаСреза = Неопределено) Экспорт
	
	Результат = Новый Структура("НаименованиеОрганизации,ДолжностьРуководителя,АдресОрганизации", Неопределено, Неопределено, Неопределено);
	
	ДатаСреза = ?(ДатаСреза = Неопределено, ТекущаяДата(), ДатаСреза);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.Организация КАК Организация,
	               |	CW_УчетнаяПолитикаСрезПоследних.НаименованиеОрганизацииАнгл КАК НаименованиеОрганизации,
	               |	CW_УчетнаяПолитикаСрезПоследних.ДолжностьРуководителяОрганизацииАнгл КАК ДолжностьРуководителя,
	               |	CW_УчетнаяПолитикаСрезПоследних.АдресОрганизацииАнгл КАК АдресОрганизации
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДатаСреза);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		 ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
